// Завдання 4.1
// π - число “пі”. Ви можете використати Math.PI у вашому дз для вираження цього числа
// Створіть змінну radius і присвойте їй числове значення радіуса кола.
// Обчисліть площу кола за формулою π * radius^2 і виведіть результат.

let radius = 15;
let area1 = (Math.PI*(radius*radius)); //Math.PI*(radius**2) / Math.PI*(Math.pow(radius,2)
console.log(area1.toFixed(2)); // ".toFixed(2)" округлили до 2х знач після коми

// Завдання 4.2
//Створіть змінну length і присвойте їй числове значення довжини прямокутника.
// Створіть змінну width і присвойте їй числове значення ширини прямокутника.
// Обчисліть площу прямокутника за формулою length * width і виведіть результат.

let length = 22;
let width = 11;
let area2 = length * width;
console.log(area2.toFixed(2));

// Завдання 4.3
// Створіть змінну radius і присвойте їй числове значення радіуса циліндра.
// Створіть змінну height і присвойте їй числове значення висоти циліндра.
// Обчисліть об'єм циліндра за формулою π * radius^2 * height і виведіть результат.

let radius2 = 27
let height = 19
let result = (Math.PI * Math.pow(radius, 2) * height)
console.log(result.toFixed(2));