// Завдання 3: Генерація таблиці множення
// Створіть програму, яка генерує таблицю множення для обраного числа за допомогою кожного з циклів for, while .
// Виберіть число для якого потрібно згенерувати таблицю множення.
// Використовуючи цикл for, створіть таблицю множення для обраного числа від 1 до 10. Виведіть результат в консоль.
// Використовуючи цикл while створіть аналогічну таблицю множення та виведіть її в консоль.


console.log("Використовуючи цикл for")

const number1 = 2;
for(let i= 1; i<=10; i++){
    console.log(`${number1} x ${i} = ${number1 * i}`);
}


console.log("Використовуючи цикл while")

const number2 = 7;
let a = 1;
while (a <= 10) {
    console.log(`${number2} x ${a} = ${number2 * a}`);
    a++;
}